module.exports = {
  pageTitle: "Личный кабинет - Hello",
  statusBar: {
    tariffs: {
      month: "1 месяц",
      quarter: "3 месяца",
      year: "1 год",
      trial: "Пробный период",
    },
    tariffStatus: {
      active: "Подписка активна",
      canceled: "Подписка отменена",
      paused: "Подписка приостановлена",
    },
    paymentFailed: "Платеж не прошел",
    freeUntil: "Бесплатно до",
    nextPayment: "Следующая оплата",
    bindCardAndPay:
      "Привяжите карту к вашему аккаунту и оплатите тариф, для возобновления подписки",
    activeUntil: "Действует до",
    afterOnTariff: ", далее по тарифу",
    paymentFailedText:
      "Оплата подписки не была произведена, проверьте выбранный способ оплаты и попробуйте еще раз",
    bindCardForTrial:
      "Привяжите карту к вашему аккаунту для использования подписки после пробного периода",
    changeTariffButton: "Изменить тариф",
    bindCardButton: "Привязать карту",
    bindCardAndPayButton: "Привязать карту и оплатить",
    renewSubscribeButton: "Возобновить подписку",
    checkPaymentButton: "Проверить платежные данные",
    cancelSubscribeButton: "Отменить подписку",
  },
  benefits: {
    title: {
      withPremium: "Все привилегии <span>подписки</span>",
      withoutPremium: "Откройте все преимущества <span>Hello Premium</span>",
    },
    items: {
      0: {
        title: "Безлимитный просмотр профилей",
        text: "Смотрите и знакомьтесь без ограничений.",
      },
      1: {
        title: "Избранные без ограничений",
        text: "Добавляйте в список Избранных важные знакомства.",
      },
      2: {
        title: "Черный список",
        text: "Защитите себя от нежелательных знакомств.",
      },
      3: {
        title: "Увеличенный срок хранения найденных профилей",
        text: "Смотрите всех, кого нашел Hello, в любое удобное время.",
      },
      4: {
        title: "Показ пола и ориентации только по вашему усмотрению",
        text: "Показывайте пол и ориентацию только схожим с вами людям.",
      },
      5: {
        title: "Уникальные профили",
        text: "Выделяйтесь среди всех с возможностью кастомизировать карточки профилей.",
      },
      6: {
        title: "Отключение входящих сообщений",
        text: "Ограничьте отправку вам сообщений для спокойной работы и отдыха.",
      },
      7: {
        title: "Отображение вашего профиля только нужным вам людям",
        text: "Скрывайте свой профиль от нежелательных категорий пользователей.",
      },
      8: {
        title: "Добавление в телефонную книгу всех полезных знакомств",
        text: "Экспортируйте всю полезную информацию из найденных профилей к себе на устройство.",
      },
      9: {
        title: "Гиперссылки в профилях",
        text: "Переходите к коллегам и партнерам интересующих вас людей в один клик.",
      },
      10: {
        title: "Уникальный значок подписчика",
        text: "Добавьте значок Premium рядом с именем.",
      },
      11: {
        title: "Работаем над новыми функциями",
        text: "Получаем обратную связь и думаем об улучшении сервиса каждый день.",
      },
    },
  },
};
