module.exports = {
  pageTitle: "Личный кабинет - Hello",
  jumbotron: {
    title: "Hello Premium",
    subtitle:
      "Черный список, настройки приватности, безлимитный просмотр профилей и еще множество возможностей.",
    button: {
      withTrial: "Оформить подписку",
      withoutTrial: "Попробовать бесплатно",
    },
    rulesText:
      "1 месяц бесплатно не доступен для пользователей,<br>которые уже пробовали Премиум",
  },
  benefits: {
    title: "Откройте все преимущества <span>Hello Premium</span>",
    items: {
      0: {
        title: "Безлимитный просмотр профилей",
        text: "Смотрите и знакомьтесь без ограничений.",
      },
      1: {
        title: "Избранные без ограничений",
        text: "Добавляйте в список Избранных важные знакомства.",
      },
      2: {
        title: "Черный список",
        text: "Защитите себя от нежелательных знакомств.",
      },
      3: {
        title: "Увеличенный срок хранения найденных профилей",
        text: "Смотрите всех, кого нашел Hello, в любое удобное время.",
      },
      4: {
        title: "Показ пола и ориентации только по вашему усмотрению",
        text: "Показывайте пол и ориентацию только схожим с вами людям.",
      },
      5: {
        title: "Уникальные профили",
        text: "Выделяйтесь среди всех с возможностью кастомизировать карточки профилей.",
      },
      6: {
        title: "Отключение входящих сообщений",
        text: "Ограничьте отправку вам сообщений, для спокойной работы и отдыха.",
      },
      7: {
        title: "Отображение вашего профиля только нужным вам людям",
        text: "Скрывайте свой профиль от нежелательных категорий пользователей.",
      },
      8: {
        title: "Добавление в телефонную книгу всех полезных знакомств",
        text: "Экспортируйте всю полезную информацию из найденных профилей к себе на устройство.",
      },
      9: {
        title: "Гиперссылки в профилях",
        text: "Переходите к коллегам и партнерам интересующих вас людей в один клик.",
      },
      10: {
        title: "Уникальный значок подписчика",
        text: "Добавьте значок Premium рядом с именем.",
      },
      11: {
        title: "Работаем над новыми функциями",
        text: "Получаем обратную связь и думаем об улучшении сервиса каждый день.",
      },
    },
  },
  chooseTariff: {
    title: "Выберите свой тариф",
    button: {
      withTrial: "Подключить",
      withoutTrial: "Попробовать бесплатно",
    },
    items: {
      month: {
        title: "1 месяц",
        free: "1 месяц бесплатно",
        freeDescription: "каждый следующий месяц - по тарифу",
        benefitPercent: "%",
        benefitDescription: "Нет выгоды",
        benefitBackground: "rgba(23, 23, 23, 0.12)",
        modalTitle: "Перейти на ежемесячную подписку?",
        modalDescription: "Далее каждый месяц — по тарифу",
      },
      quarter: {
        title: "3 месяца",
        free: "1 месяц бесплатно",
        freeDescription: "каждые следующие 3 месяца - по тарифу",
        benefitPercent: "-10%",
        benefitDescription: "выгода по сравнению с тарифом 1 месяц",
        benefitBackground: "#F56E51",
        modalTitle: "Перейти на 3-х месячную подписку?",
        modalDescription: "Далее каждые 3 месяца — по тарифу",
      },
      year: {
        title: "1 год",
        free: "1 месяц бесплатно",
        freeDescription: "каждый следующий год - по тарифу",
        benefitPercent: "-20%",
        benefitDescription: "выгода по сравнению с тарифом 1 месяц",
        benefitBackground: "#A351F5",
        modalTitle: "Перейти на ежегодную подписку?",
        modalDescription: "Далее каждый год — по тарифу",
      },
    },
  },
};
