export const MOC_BENEFITS = [
  [
    {
      icon: "/images/icons/benefit_eye.svg",
      title: "Безлимитный просмотр профилей",
      text: "Смотрите и знакомьтесь без ограничений.",
    },
    {
      icon: "/images/icons/star_36.svg",
      title: "Избранные без ограничений",
      text: "Добавляйте в список Избранных важные знакомства.",
    },
  ],
  [
    {
      icon: "/images/icons/paper_negativ_36.svg",
      title: "Черный список",
      text: "Защитите себя от нежелательных знакомств.",
    },
    {
      icon: "/images/icons/bookmark_36.svg",
      title: "Увеличенный срок хранения найденных профилей",
      text: "Смотрите всех, кого нашел Hello, в любое удобное время.",
    },
  ],
  [
    {
      icon: "/images/icons/lock_36.svg",
      title: "Показ пола и ориентации только по вашему усмотрению",
      text: "Показывайте пол и ориентацию только схожим с вами людям.",
    },
    {
      icon: "/images/icons/user_36.svg",
      title: "Уникальные профили",
      text: "Выделяйтесь среди всех с возможностью кастомизировать карточки профилей.",
    },
  ],
  [
    {
      icon: "/images/icons/chat_36.svg",
      title: "Отключение входящих сообщений",
      text: "Ограничьте отправку вам сообщений, для спокойной работы и отдыха.",
    },
    {
      icon: "/images/icons/view_outline_36.svg",
      title: "Отображение вашего профиля только нужным вам людям",
      text: "Скрывайте свой профиль от нежелательных категорий пользователей.",
    },
  ],
  [
    {
      icon: "/images/icons/add_contacts_36.svg",
      title: "Добавление в телефонную книгу всех полезных знакомств",
      text: "Экспортируйте всю полезную информацию из найденных профилей к себе на устройство.",
    },
    {
      icon: "/images/icons/link_circle_36.svg",
      title: "Гиперссылки в профилях",
      text: "Переходите к коллегам и партнерам интересующих вас людей в один клик.",
    },
  ],
  [
    {
      icon: "/images/icons/crown_36.svg",
      title: "Уникальный значок подписчика",
      text: "Добавьте значок Premium рядом с именем.",
    },
    {
      icon: "/images/icons/frame_36.svg",
      title: "Работаем над новыми функциями",
      text: "Получаем обратную связь и думаем об улучшении сервиса каждый день.",
      mocced: true,
    },
  ],
];

export const HOME_BENEFITS = [
  "Кастомизация профилей",
  "Избранные без ограничений",
  "Безлимитный просмотр профилей",
  "Черный список",
  "Экспорт профиля в контакты",
  "и еще 10+ привилегий",
];
