export const WII_ITEMS = [
  {
    title: "Простой поиск",
    text: "Простой и удобный поиск людей поблизости, использующий bluetooth и работающий в фоне",
    icon: "/images/icons/people_search.svg",
  },
  {
    title: "Фильтры по категориям",
    text: "Система фильтрации, позволяющая тонко настроить поиск и находить только нужные вам контакты и знакомства",
    icon: "/images/icons/account_filter.svg",
  },
  {
    title: "Обмен сообщениями",
    text: "Короткие Push-сообщения, позволяющие быстро обмениваться своим профилем с другими людьми",
    icon: "/images/icons/message.svg",
  },
  {
    title: "Широкий выбор настроек",
    text: "Настройки профилей и аккаунта, позволяющие настроить ваш опыт взаимодействия с приложением",
    icon: "/images/icons/slide_settings.svg",
  },
];
