module.exports = {
  pageTitle: "Hello - Новые знакомства рядом с вами",
  jumbotron: {
    title: "Новые знакомства рядом с вами",
    subtitle:
      "Ищите новые знакомства и полезные контакты через bluetooth, в приложении Hello",
    downloadText: "Скачивайте приложение и присоединяйтесь с сообществу Hello",
    downloadLink: "Скачать приложение",
    qrText: "Наведите камеру на QR-код, чтобы скачать",
  },
  howItWork: {
    title: "Как работает <span>Hello</span>",
    items: {
      0: "Скачайте приложение на телефон",
      1: "Зарегистрируйтесь и создайте личный или бизнес профиль",
      2: "Включите bluetooth и начните искать интересных людей поблизости",
      3: "Расширяйте сообщество Hello, рассказывая о нас друзьям и коллегам",
    },
  },
  whatIsIt: {
    title: "Что такое <span>Hello</span>",
    items: {
      0: {
        title: "Простой поиск",
        text: "Простой и удобный поиск людей поблизости, использующий bluetooth и работающий в фоне",
      },
      1: {
        title: "Фильтры по категориям",
        text: "Система фильтрации, позволяющая тонко настроить поиск и находить только нужные вам контакты и знакомства",
      },
      2: {
        title: "Обмен сообщениями",
        text: "Короткие Push-сообщения, позволяющие быстро обмениваться своим профилем с другими людьми",
      },
      3: {
        title: "Широкий выбор настроек",
        text: "Настройки профилей и аккаунта, позволяющие настроить ваш опыт взаимодействия с приложением",
      },
    },
  },
  functions: {
    title: "Основные функции и возможности",
    items: {
      0: {
        title: "Избранные профили",
        text: "Список избранных профилей с возможностью поиска и сортировкой по алфавиту",
      },
      1: {
        title: "Поиск",
        text: "Поиск пользователей поблизости при помощи bluetooth с возможностью отложенного просмотра",
      },
      2: {
        title: "Фильтры",
        text: "Тонко настраиваемый фильтр поиска пользователей по выбранным категориям с возможностью поиска в фоне",
      },
      3: {
        title: "Два вида профилей",
        text: "Можно создать бизнес и личный профиль для разного рода знакомств и контактов",
      },
      4: {
        title: "Настройки видимости",
        text: "Настройка времени отображения вашего профиля другим пользователям",
      },
      5: {
        title: "Короткие сообщения",
        text: "Отправка коротких сообщений, позволяющих общаться и делиться вашим профилем с интересным вам людьми",
      },
    },
  },
  benefits: {
    title: "Больше возможностей с подпиской <span>Premium</span>",
    subtitle:
      "Подключите <span>Premium бесплатно</span> на 1 месяц и получите новый опыт взаимодействия с приложением&#46;",
    button: "Подробнее",
    items: {
      0: "Кастомизация профилей",
      1: "Избранные без ограничений",
      2: "Безлимитный просмотр профилей",
      3: "Черный список",
      4: "Экспорт профиля в контакты",
      5: "и еще 10+ привилегий",
    },
  },
  connect: {
    title: "Присоединяйтесь к сообществу <span>Hello</span>",
    subtitle: "Приложение Hello позволит расширить ваши личные и бизнес связи",
  },
};
