import React from "react";
import Markdown from "markdown-to-jsx";

export const TermsContent = () => {

  const text = `
**ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ ДЛЯ ПРИЛОЖЕНИЯ**

**1. ОПРЕДЕЛЕНИЕ ПОНЯТИЙ**

В тексте настоящего Соглашения нижеизложенным терминам дано следующее значение:

" **Компания**", " **Мы**", " **Наш**", " **Нас**", " **Нами**" или какие-либо другие схожие производные (в зависимости от контекста) означает следующее лицо: WEDOOKPRODUCTS, адрес местонахождения: Россия (включая, его филиалы и представительства как на территории Российской Федерации, так и за ее пределами, а также какие-либо другие лица, созданные в результате реорганизации Компании), которые являются владельцами Приложения или им управляют.

" **Контент приложения**" означает все объекты, размещенные Компанией и/или третьими лицами (с разрешения Компании) в Приложении, в том числе элементы дизайна, текст, графические изображения, иллюстрации, виртуальные объекты, видео, программы, музыка, звуки, информация, уведомления и какие-либо другие схожие объекты, их подборки или комбинации.

" **Обновления**" означает программный патч или программный пакет для Приложения, который время от времени выпускается Компанией, предлагается для бесплатной загрузки Пользователями, которые уже используют Приложение, и направлен на фиксацию неработающих функций Приложения, устранение багов (ошибок) в работе Приложения или внедрение небольших программных компонентов для обеспечения большей безопасности и совместимости Приложения с устройствами.

" **Платформа**" означает облачную платформу, на которой Компания разместила Приложение для его последующего скачивания Пользователем. Настоящее Приложение доступно для скачивания из App Store и Google Play Store.

" **ПО приложения**" означает программное обеспечение, разработанное Компанией (и/или третьими лицами по поручению Компании) для Приложения, включая, однако не ограничиваясь, весь софт, скрипты, коды (HTML коды), программы и тп.

" **Пользователь**", " **Вы**", " **Ваш**", " **Вас**", " **Вами**" или какие-либо другие схожие производные (в зависимости от контекста) означает лицо, которое **(1)** пользуется Приложением и получило доступ к Услугам; и **(2)** дало свое согласие на соблюдение правил пользования Приложением, изложенных в тексте данного Соглашения, путем использования Приложения.

" **Пользовательский контент**" означает **(1)** все публикации, совершенные Пользователем в Приложении, включая, однако не ограничиваясь, комментарии; оценки; отзывы; отчеты; фидбеки; размещенные видео, фотографии, музыка и другие медиа файлы; проставленные лайки; рейтинги и/или какие-либо другие формы активности, доступные Пользователю, а также **(2)** какой-либо другой контент, создаваемый Пользователем.

" **Приложение**" означает следующее приложение: Hello, которое Пользователь загружает через Платформу на смартфон или другое устройство.

" **Услуги**" означает совокупно Контент приложения и ПО приложения.

" **In-app покупка**" означает получение Пользователем за плату дополнительных возможностей и/или функционала для Приложения и/или приобретение каких-либо виртуальных товаров/услуг в рамках Приложения.

**2. ПРИСОЕДИНЕНИЕ К СОГЛАШЕНИЮ**

**Общие положения**

2.1. Настоящее Пользовательское соглашение (далее " **Соглашение**") определяет правила и порядок использования Приложения, права и обязанности Пользователей, а также регулирует поведение Пользователей при получении доступа к Приложению и Услугам.

2.2. Пользователь принимает условия данного Соглашения посредством продолжения использования Приложения.

2.3. Данное Соглашение является обязательным для его сторон (т.е. для Компании и Пользователя). Уступка Пользователем своих прав по данному Соглашению возможна только после получения предварительного письменного согласия от Компании.

2.4. Если Вы являетесь законным представителем (родителем, опекуном) несовершеннолетнего Пользователя, в таком случае Вы автоматически соглашаетесь от своего имени и от имени такого несовершеннолетнего Пользователя на условия данного Соглашения.

**Предупреждение для пользователей**

2.5. Если Пользователь осуществляет доступ к Приложению и/или его Услугам через номер телефона, в таком случае Пользователь автоматически считается таким, который принял условия пользовательского соглашения такой Платформы или социальной сети.

2.6. Пользователь признает, что его соглашение с провайдером мобильной сети (далее " **Провайдер**") будет применяться к использованию Пользователем данного Приложения. Пользователь также признает, что Провайдер может взимать с Пользователя время от времени плату за услуги передачи данных при использовании отдельных функций Приложения, а также какие-либо иные сборы и платежи, возникающие в связи с такой передачей и за которые Пользователь обязуется нести ответственность. Если Пользователь не является плательщиком счетов Провайдера на смартфоне или другом устройстве, используемом для доступа в Приложение, предполагается, что такой Пользователь получил разрешение от плательщика счета на использование Приложения.

2.7. Пользователь является единственным ответственным лицом за проверку и контроль соответствия устанавливаемого Приложения техническим особенностям/возможностям смартфона или иного устройства и/или других ограничений, которые могут быть применимы к Пользователю и/или его смартфону или другому устройству третьими лицами, включая Интернет провайдера.

**3. ПОЛЬЗОВАТЕЛИ ПРИЛОЖЕНИЯ**

**Общие критерии и возраст**

3.1. Для использования Приложения Пользователи должны соответствовать следующим критериям (совокупно):

**(1)** быть не младше 14-лет; и

**(2)** не быть ограниченными в праве доступа к Приложению и Услугам на основании решения суда, вступившего в законную силу, или в случаях, предусмотренных действующим законодательством или условиями данного Соглашения.

**Создание личного аккаунта**

3.2. Пользование Услугами возможно как Пользователями, которые прошли процедуру создания личного аккаунт (кабинета), так и Пользователями, которые отказались от такого создания. Незарегистрированные Пользователи не имеют доступа к следующим Услугам:

_обмен сообщениями, поиск пользователей, создание профилей_

3.3. Для снятия указанных ограничений и получения полного доступа Пользователю необходимо создать свой личный аккаунт (кабинет). По результатам завершения регистрации Пользователь получает уникальный логин и пароль.

3.4. Действие данного Соглашения распространяется одинаково в полном объеме (без каких-либо исключений) как на Пользователей с личным аккаунтом (кабинетом), так и без него.

3.5. Для создания личного аккаунта (кабинета) Пользователю необходимо предоставить следующею информацию о себе:

_ФИО, дата рождения, пол, номер телефона_

**4. ИНТЕЛЛЕКТУАЛЬНАЯ СОБСТВЕННОСТЬ**

**Пользовательская лицензия**

4.1. Пользователь получает неисключительную, без права передачи и сублицензии, ТОЛЬКО для личного (некоммерческого) пользования лицензию на Услуги (далее " **Пользовательская лицензия**"). Пользователь берет на себя обязательство не использовать Услуги в каких-либо других целях. Пользователь получает указанную Пользовательскую лицензию ТОЛЬКО при условии соблюдения ВСЕХ условий данного Соглашения.

4.2. Пользовательская лицензия прекращает действовать автоматически при удалении Приложения со смартфона или другого устройства Пользователя. Ничто в тексте настоящего Соглашения не должно быть истолковано как право на получение Пользователем какой-либо иной лицензии на использование объектов интеллектуальной собственности, принадлежащих Компании или находящихся в ее владении, кроме той, которая предоставлена выше.

**Интеллектуальная собственность компании**

4.3. Компании принадлежат все без исключения права собственности, включая имущественные права интеллектуальной собственности, на весь Контент приложения, а также ПО приложения. ПО приложения и Контент приложения защищены авторским правом в порядке, предусмотренном действующим гражданским законодательством Российской Федерации, а также международными договорами и конвенциями в области защиты объектов интеллектуальной собственности.

4.4. ПОЛЬЗОВАТЕЛЯМ ЗАПРЕЩЕНО копировать, воспроизводить, модифицировать, компилировать, распространять, отображать в какой-либо форме, публиковать, скачивать, передавать, продавать (полностью или частично), отчуждать любым возможным способом за плату или безвозмездно, передавать в сублицензию, каким-либо способом распространять или использовать Контент приложения и ПО приложения, кроме случаев, когда такие действия ПРЯМО разрешены условиями данного Соглашения или действующим законодательством Российской Федерации.

4.5. Ничто в тексте данного Соглашения не может быть истолковано как передача Пользователю каких-либо исключительных прав на Контент приложения (полностью или в отдельной части) и/или ПО приложения.

4.6. Компания владеет всеми правами в отношении торговых марок, коммерческих (бизнес) наименований, брендов, логотипов, зарегистрированных на ее имя (далее " **Торговые марки**"). Такие Торговые марки защищаются действующим законодательством и НИЧТО в тексте данного Соглашения не может быть истолковано как передача какой-либо лицензии Пользователю на использование таких Торговых марок.

**5. ПОРЯДОК РАБОТЫ С ПРИЛОЖЕНИЕМ**

**Общие положения**

5.1. Пользователь обязуется соблюдать следующие правила при работе с Приложением:

**(1)** соблюдать все обязательства, взятые на себя Пользователем в связи с присоединением к данному Соглашению; и

**(2)** предоставлять достоверные о себе данные для создания личного аккаунта (кабинета); и

**(3)** не выдавать себя за какое-либо другое лицо, включая, однако не ограничиваясь, не предоставлять какие-либо данные третьих лиц (без получения от них прямого, предварительного и осознанного согласия) для создания личного аккаунта (кабинета); и

**(4)** информировать Компанию о хищении логинов, паролей или каких-либо других ключей доступа Пользователя к личному аккаунту (кабинету); и

**(5)** не предоставлять третьим лицам доступ к своему аккаунту (кабинету) и/или логины, пароли или другие ключи доступа; и

**(6)** не загружать, не хранить, не публиковать, не распространять, не размещать, не рекламировать, не отправлять, не предоставлять доступ или иным образом не использовать Пользовательский контент, который **(а)** содержит угрозы, дискредитирует, оскорбляет, порочит честь и достоинство или деловую репутацию или нарушает неприкосновенность частной жизни других Пользователей или третьих лиц; и **(б)** является спамом, буллингом, вульгарным или непристойным, содержит порнографические изображения и тексты, сцены сексуального характера, в том числе с участием несовершеннолетних, или сцены насилия, включая сексуальное, над людьми или животными; и **(в)** содержит какие-либо формы подстрекательства к суициду и/или пропагандирует или способствует разжиганию расовой, религиозной, этнической ненависти или вражды, пропагандирует фашизм или идеологию расового превосходства, или содержит экстремистские материалы; и **(г)** пропагандирует нарушение прав или законных интересов других Пользователей или третьих лиц или пропагандирует преступление или содержит советы/руководства/инструкции по его совершению; и **(д)** нарушает иные правила данного Соглашения или является запрещенным на основании действующего законодательства; и

**(7)** не совершать какие-либо действия (с использованием средств автоматизации или без таких средств), направленные на сбор каких-либо персональных данных других Пользователей; и

**(8)** не предпринимать какие-либо действия и не помогать третьим лицам в совершении действий, направленных на подрыв работы Приложения и/или Услуг, включая, однако не ограничиваясь**, (а)** загружать вирусы или вредоносный код; **(б)** совершать действия, которые могут привести к отключению Приложения и/или Услуг, к нарушению нормальной работы Приложения или его программного обеспечения, или к ухудшению внешнего вида Приложения и/или Контента приложения.

**(9)** не предпринимать какие-либо иные действия, которые являются незаконными, мошенническими, дискриминационными или вводящими в заблуждение.

**Права пользователей на размещенный контент**

5.2. Создаваемый Вами Пользовательский контент является объектом интеллектуальной собственности, защищается действующим законодательством, в связи с чем Компания не претендует на получение и не требует от Вас предоставления ей каких-либо прав собственности на Ваш Пользовательский контент. Ничто в тексте настоящего Соглашения не должно быть истолковано как лишение Пользователя прав на создаваемый им Пользовательский контент или их ограничение.

5.3. Вместе с этим Вы предоставляете Компании неисключительную, не требующую лицензионных отчислений, действующую по всему миру лицензию (далее " **Лицензия**") с правом передачи и выдачи сублицензий на хранение, использование, распространение, изменение, запуск, копирование, публичное исполнение или показ, перевод Вашего Пользовательского контента и создание производных работ на его основе.

5.4. Действие выданной Вами таким образом Лицензии автоматически прекращается в случае удаления Вашего личного аккаунта (кабинета) или в случае удаления Приложения со смартфона или другого устройства.

5.5. Компания обязуется предпринять все возможные действия, направленные на полное удаление Вашего Пользовательского контента сразу после наступления обстоятельств для прекращения Лицензии, за исключением следующих случаев когда: **(1)** часть Вашего Пользовательского контента была использована другими Пользователями (на основании выданной Вами ранее Лицензии, в таком случае Ваш Пользовательский контент будет доступным до тех пор другим Пользователям, пока другой Пользователь не совершит его удаление); или **(2)** Пользовательский контент, размещенный Вами, является доказательством какого-либо нарушения, проступка или преступления в уголовном, административном или гражданском производстве, или его последующее хранение требуется на основании требований действующего законодательства или полученного запроса от компетентного государственного органа; или **(3)** в других случаях, указанных в данном Соглашении.

**Требование к пользовательскому контенту**

5.6. Пользователям запрещается загружать какой-либо Пользовательский контент, который может принадлежать третьим лицам или права на использование которого не были в необходимом объеме предоставлены такому Пользователю. Настоящим Пользователь берет на себя обязанность возместить Компании ВСЕ УБЫТКИ И СУДЕБНЫЕ ИЗДЕРЖКИ, КОТОРЫЕ БЫЛИ ЕЙ ПОНЕСЕНЫ В СВЯЗИ С ПРЕДЪЯВЛЕНИЕМ ИСКА ТРЕТЬИМИ ЛИЦАМИ О ТОМ, ЧТО ОПУБЛИКОВАННЫЙ ПОЛЬЗОВАТЕЛЬСКИЙ КОНТЕНТ НАРУШАЕТ ПРАВА ИНТЕЛЛЕКТУАЛЬНОЙ СОБСТВЕННОСТИ ТАКИХ ТРЕТЬИХ ЛИЦ.

5.7. Пользователю не рекомендуется загружать какой-либо Пользовательский контент, который может содержать конфиденциальную или иную личную информацию. Компания признает любой Пользовательский контент таким, который не содержит конфиденциальной информации вовсе, а потому не берет на себя какие-либо обязательства по его защите от разглашения или посягательств третьих лиц.

5.8. Компания не проверяет и не может проверить все материалы, публикуемые Пользователями в рамках создаваемого ими Пользовательского контента, в связи с чем Компания не несет ответственности за содержание такого Пользовательского контента, за его использование и/или его воздействие на третьих лиц или других Пользователей. Управление или владение Приложением не означает, что Компания подтверждает, поддерживает, гарантирует, распространяет и/или верит в информацию, размещаемую в рамках Пользовательского контента.

5.9. Пользователь является ответственным за свою собственную защиту и защиту своего устройства от вирусов и прочего вредоносного ПО. Компания не берет на себя какую-либо ответственность за вред, причиненный в результате использования Приложения, его Услуг и/или Пользовательского контента (включая его загрузку).

5.10. Компания имеет право в любой момент проверить Пользовательский контент на предмет его соответствия требованиям данного Соглашения или действующему законодательству. Вместе с этим ничто в тексте данного Соглашения не должно быть истолковано как прямая обязанность Компании проводить какую-либо самостоятельную проверку Пользовательского контента не иначе, как по запросу других Пользователей или третьих лиц.

5.11. Если Вы столкнулись с Пользовательским контентом, который нарушает условия данного Соглашения или законные права и интересы Пользователей или третьих лиц, Вы можете направить свою жалобу следующим образом:

_Отправить письмо на wedookproducts.access@gmail.com_

5.12. Если будет обнаружено, что Пользовательский контент нарушает условия данного Соглашения или положения действующего законодательства, Компания имеет право по своему собственному усмотрению, в любой момент, без необходимости предупреждения Пользователя и взятия на себя какой-либо ответственности в будущем удалить такой Пользовательский контент вовсе, а в случае повторного нарушения - удалить Ваш личный аккаунт (кабинет).

5.13. С целью исполнения требований ч. 1 статьи 10-6 Федерального закона "Об информации, информационных технологиях и о защите информации" Компания имеет право проводить внутренний мониторинг Пользовательского контента с целью соблюдения Пользователями ограничений, изложенных в Федеральном законе "Об информации, информационных технологиях и о защите информации".

**Отзывы о работе приложения**

5.14. Каждый Пользователь время от времени имеет право (но не обязанность) оставлять или направлять свои идеи, отзывы, предложения или проекты, направленные на улучшение работы Приложения или качества предоставляемых Услуг. Такие отзывы могут быть направлены Пользователем следующим способом:

_отправить письмо на wedookproducts.access@gmail.com_

5.15. В случае направления такой идеи, отзыва, предложения или проекта Пользователь автоматически предоставляет нам неисключительную, не требующую лицензионных отчислений, действующую по всему миру лицензию с правом передачи и выдачи сублицензий на хранение, использование, распространение, изменение, запуск, копирование, публичное исполнение или показ, перевод Ваших идей, отзывов, предложений или проектов, а также создание производных работ на их основе.

5.16. Любая такая информация, предоставляемая Компании, автоматически признается неконфиденциальной.

**6. РАЗМЕЩЕНИЕ РЕКЛАМЫ В ПРИЛОЖЕНИИ**

**Размещение рекламы компанией**

6.1. Компания имеет право время от времени размещать какие-либо рекламные или маркетинговые материалы.

**Размещение рекламы третьими лицами**

6.2. Контент приложения может содержать ссылки на веб-сайты третьих лиц и/или рекламные или маркетинговые материалы о товарах/услугах, предоставляемых такими третьими лицами (далее " **Реклама третьих лиц**"). КОМПАНИЯ НЕ БЕРЕТ НА СЕБЯ КАКУЮ-ЛИБО ОТВЕТСТВЕННОСТЬ **(1)** ЗА СОДЕРЖАНИЕ РЕКЛАМЫ ТРЕТЬИХ ЛИЦ, А ТАКЖЕ ЗА НАЛИЧИЕ, КАЧЕСТВО И БЕЗОПАСНОСТЬ ПРОДВИГАЕМЫХ ТОВАРОВ/УСЛУГ В ТАКОЙ РЕКЛАМЕ; и **(2)** ЗА КАКИЕ-ЛИБО УБЫТКИ, ПОТЕРИ ИЛИ УЩЕРБ, ПОНЕСЕННЫЕ ИЛИ ПРИЧИНЕННЫЕ ПОЛЬЗОВАТЕЛЮ В РЕЗУЛЬТАТЕ ПРОЧТЕНИЯ ИМ ТАКОЙ РЕКЛАМЫ, ИСПОЛЬЗОВАНИЯ ИМ ПРОДВИГАЕМЫХ В РЕКЛАМЕ ТРЕТЬИХ ЛИЦ ТОВАРОВ/УСЛУГ.

6.3. В случае перехода на другой сайт через размещенную Рекламу третьих лиц, Компания не может гарантировать, что такой веб-сайт является безопасным для Пользователя и/или его компьютера. Ни что в тексте данного Соглашения не должно быть истолковано как заверение, поощрение, рекомендация или побуждение Пользователя воспользоваться Рекламой третьих лиц, посетить какие-либо сайты третьих лиц, а также попробовать, приобрести, воспользоваться какими-либо товарами/услугами третьих лиц.

6.4. Вопросы, связанные с защитой персональных данных Пользователей при использовании ими Рекламы третьих лиц, регулируются Политикой конфиденциальности приложения.

**7. ПРОВЕДЕНИЕ ОПЛАТЫ ЧЕРЕЗ ПРИЛОЖЕНИЕ**

7.1. Приложение не предоставляет возможность покупки каких-либо товаров/услуг через него.

**8. СОВЕРШЕНИЕ IN-APP ПОКУПОК**

8.1. Совершение каких-либо In-app покупок внутри Приложения не предусмотрено.

**9. ДОСТУП К ПРИЛОЖЕНИЮ**

**Общие положения**

9.1. Компания оставляет за собой право изменить или модифицировать Контент приложения в любой момент без указания причины, по своему собственному усмотрению и без необходимости уведомления об этом Пользователя. Компания также оставляет за собой право модифицировать, прервать или прекратить работу части или всего Приложения в любой момент без какого-либо дополнительного уведомления. В связи с изложенным Компания не берет на себя какую-либо ответственность перед Пользователями или третьими лицами за любые произведенные изменения, модификации, удаления, упразднения, прекращения или перерывы в работе Приложения.

9.2. Компания не гарантирует, что Приложение и Услуги будут доступными Пользователю постоянно. Время от времени Компания может сталкиваться с проблемами в работе оборудования, ПО приложения или другими неполадками, в связи с чем Компании может потребоваться время на изучение и устранение таких проблем. Такое устранение ошибок может привести к сбоям, задержкам или ошибкам в работе Приложения. Компания оставляет за собой право изменять, пересматривать, обновлять, приостанавливать, прекращать или иным образом изменять Приложение в любое время или по любой причине без предварительного уведомления. Пользователь соглашается с тем, что Компания не несет ответственности за какие-либо убытки, ущерб или неудобства, вызванные неспособностью Пользователя получить доступ или использовать Приложение во время простоя или прекращения работы Приложения. Ничто в условиях данного Соглашения не будет истолковано как обязывающее Нас поддерживать работу Приложения без остановок и сбоев.

**Предоставление обновлений**

9.3. Компания время от времени может предоставлять Обновления и требовать их инсталляции на смартфон или другое устройство Пользователя. В данном случае Пользователь является единственным ответственным лицом за установление Обновлений и несет полную ответственность за какие-либо убытки, потери, ущерб или упущенную выгоду, причиненную Пользователю несвоевременным установлением Обновлений или неустановлением их вовсе, несовместимостью установленных Обновлений и смартфона/другого устройства. Компания не предоставляет какую-либо техническую поддержку или интернет соединение Пользователю для возможности получения доступа к Услугам и/или их Обновлениям.

**Удаление аккаунта**

9.4. Пользователь имеет право в любой момент прекратить использование Приложения посредством удаления его со своего смартфона или другого устройства.

9.5. В случае **(1)** нарушения Пользователем условий настоящего Соглашения или когда у Компании есть достаточные основания полагать, что такие нарушения были допущены; и/или **(2)** нарушения прав интеллектуальной собственности Компании, других Пользователей или третьих лиц; и/или **(3)** совершения действий, которые являются противозаконными, нарушают права и интересы Компании, других Пользователей или третьих лиц или подрывают работу Приложения или возможность использования Приложения другими Пользователями; и/или **(4)** Пользователь использует Услуги или Приложение таким образом, что это может повлечь юридическую ответственность для Компании в будущем; и/или **(5)** если этого требует действующее законодательство или компетентный государственный орган, Компания имеет право без предварительного уведомления в любой момент прекратить (остановить) доступ Пользователя к Приложению и Услугам посредством удаления его аккаунта.

При наступлении обстоятельств, изложенных в предыдущем абзаце, Пользователю запрещено создавать какие-либо другие аккаунты в Приложении в будущем.

9.6. Во всех случаях удаления аккаунта Пользователя или удаления Приложения со смартфона или другого устройства Пользователя все данные и информация, размещенные Пользователем в аккаунте и/или связанные с ним, будут безвозвратно удалены. Компания не берет на себя какую-либо ответственность за удаление таких данных и информации, а также за какой-либо вред, ущерб, убытки или упущенную выгоду, причиненную Пользователю таким удалением и/или отсутствием доступа к Услугам в целом.

**10. ЗАДАТЬ ВОПРОС**

10.1. Если у Вас есть вопросы касательно условий настоящего Соглашения или порядка/способа их исполнения, Вы можете адресовать нам свой вопрос следующим способом:

_отправить письмо на wedookproducts.access@gmail.com_

10.2. Сотрудники и представители Компании обязуются предпринять все возможные усилия для дачи ответа на Ваш запрос в течение разумного периода времени.

**11. ОТВЕТСТВЕННОСТЬ**

11.1. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ КОМПАНИЯ ИЛИ ЕЕ ПРЕДСТАВИТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТЬ ПЕРЕД ПОЛЬЗОВАТЕЛЕМ ИЛИ ПЕРЕД ЛЮБЫМИ ТРЕТЬИМИ ЛИЦАМИ:

**(1)** ЗА ЛЮБОЙ КОСВЕННЫЙ, СЛУЧАЙНЫЙ, НЕУМЫШЛЕННЫЙ УЩЕРБ, ВКЛЮЧАЯ УПУЩЕННУЮ ВЫГОДУ ИЛИ ПОТЕРЯННЫЕ ДАННЫЕ, ВРЕД ЧЕСТИ, ДОСТОИНСТВУ ИЛИ ДЕЛОВОЙ РЕПУТАЦИИ, ВЫЗВАННЫЙ ИСПОЛЬЗОВАНИЕМ ПРИЛОЖЕНИЯ, УСЛУГ ИЛИ ИНЫХ МАТЕРИАЛОВ, К КОТОРЫМ ПОЛЬЗОВАТЕЛЬ ИЛИ ИНЫЕ ЛИЦА ПОЛУЧИЛИ ДОСТУП С ПОМОЩЬЮ ПРИЛОЖЕНИЯ, ДАЖЕ ЕСЛИ КОМПАНИЯ ПРЕДУПРЕЖДАЛА ИЛИ УКАЗЫВАЛА НА ВОЗМОЖНОСТЬ ТАКОГО ВРЕДА; и

**(2)** ЗА ДЕЙСТВИЯ ДРУГИХ ПОЛЬЗОВАТЕЛЕЙ, ЗА РАЗМЕЩАЕМЫЙ ПОЛЬЗОВАТЕЛЯМИ ПОЛЬЗОВАТЕЛЬСКИЙ КОНТЕНТ, ЗА ТОВАРЫ/УСЛУГИ, ПРЕДОСТАВЛЯЕМЫЕ ТРЕТЬИМИ ЛИЦАМИ ИЛИ ДРУГИМИ ПОЛЬЗОВАТЕЛЯМИ (ДАЖЕ ЕСЛИ ДОСТУП К НИМ БЫЛ ПРЕДОСТАВЛЕН ЧЕРЕЗ НАШЕ ПРИЛОЖЕНИЕ), К КОТОРЫМ ПОЛЬЗОВАТЕЛЬ ПОЛУЧИЛ ДОСТУП; и

**(3)** в случаях прямо предусмотренных условиями настоящего Соглашения или нормой действующего законодательства.

11.2. Наша ответственность за все что угодно, связанное с использованием Приложения и/или Услуг, ограничивается настолько сильно, насколько это допускается действующим законодательством.

**12. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ**

12.1. В случае возникновения любых споров или разногласий, связанных с исполнением настоящего Соглашения, Пользователь и Компания приложат все усилия для их разрешения путем проведения переговоров между ними. В случае, если споры не будут разрешены путем переговоров, споры подлежат разрешению в порядке, установленном действующим законодательством Российской Федерации.

**13. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ**

13.1. Мы можем время от времени пересматривать, дополнять или изменять условия данного Соглашения. Такие изменения, как правило, не являются ретроспективными. В случае такого пересмотра, дополнения или изменения, Компания обязуется уведомить Пользователей за 0 календарных дней до момента вступления в силу таких изменений посредством публикации соответствующей информации непосредственно в самом Приложении.

Если после проведенных изменений или дополнений в тексте Соглашения Пользователь продолжает пользоваться Приложением, это значит, что он ознакомлен с изменениями или дополнениями и их принял в полном объеме без каких-либо возражений.

13.2. Если иное прямо не указано в положениях настоящего Соглашения или прямо не вытекает из норм действующего законодательства, к условиям настоящего Договора применяется материальное право Российской Федерации.

13.3. Неотъемлемой частью настоящего Соглашение является Политика конфиденциальности приложения.

13.4. Если одно или несколько условий данного Соглашения утратило свою юридическую силу или признано недействительным согласно действующему законодательству, остальные условия Соглашения не теряют своей силы и продолжают действовать так, словно признанного недействительным или утратившим юридическую силу условия не существовало вовсе.

13.5. Доступ к Приложению и его Услугам предоставляется Пользователю "как есть", Мы не обещаем, не гарантируем, не подразумеваем, что Услуги и Приложение могут подходить или не подходить Вашим потребностям, целям, ожиданиям, и в связи с чем не гарантируем какого-либо специфического результата или последствия в результате использования Вами Приложения и его Услуг.

`

  return (
    <Markdown ooptions={{ forceBlock: true }}> 
      {text}
    </Markdown>
  );
};

export const PrivacyContent = () => {
  const text = `
  Администрация приложения Hello обязуется сохранять вашу конфиденциальность в Интернете. Мы уделяем большое значение охране предоставленных вами данных. Наша политика конфиденциальности основана на требованиях [Общего регламента о защите персональных данных Европейского Союза (GDPR).](https://ec.europa.eu/info/law/law-topic/data-protection_en)Цели, в которых мы собираем персональные данные: улучшение работы нашего сервиса, осуществление контактов с посетителями данного приложения, предоставление информации, которую запрашивал пользователь, а также для указанных ниже действий.

  Сбор и использование персональных данных
  
  Мы собираем и используем ваши персональные данные только в случае вашего добровольного согласия. При согласии с этим вы разрешаете нам собирать и использовать следующие данные: имя и фамилия, дата рождения, номер телефона, личные фотографии , данные аккаунтов в социальных сетях, . Сбор и обработка ваших данных проводится соответствии с законами, действующими на территории Европейского Союза и в государстве Россия.
  
  Хранение данных, изменение и удаление
  
  Пользователь, предоставивший свои персональные данные приложению Hello имеет право на их изменение и удаление, а так же на отзыв своего согласия с их использованием. Срок, в течение которого будут храниться ваши персональные данные: время, необходимое для использования данных для основной деятельности приложения. При завершении использования ваших данных администрация приложения удаляет их. Для доступа к своим персональным данным вы можете связаться с администрацией приложения по следующему адресу: wedookproducts.access@gmail.com. Мы можем передавать ваши личные данные третьей стороне только с вашего добровольного согласия, если они были переданы, то изменение данных в других организациях, не связанных с нами, мы осуществить не можем.
  
  Использование технических данных при использовании приложения
  
  При использовании вами приложения Hello и данного сайта в базе данных хранятся записи о вашем IP адресе, времени посещения, настройках браузера, операционной системе, а также другая техническая информация необходимая для корректного отображения содержимого сайта и приложения. По этим данным нам невозможно идентифицировать личность посетителя.
  
  Предоставление информации детьми
  
  Если Вы являетесь родителем или опекуном, и вы знаете, что ваши дети предоставили нам свои личные данные без Вашего согласия, свяжитесь с нами: wedookproducts.access@gmail.com. На нашем сервисе запрещено оставлять личные данные несовершеннолетних без согласия родителей или опекунов.
  
  Использование персональных данных другими сервисами
  
  На этом сайте используются сторонние интернет-сервисы, осуществляющие независимый от нас сбор информации: , . Собранные ими данные могут предоставляться другим службам внутри этих организаций, они могут использовать данные для персонализации рекламы своей собственной рекламной сети. Вы можете прочитать пользовательские соглашения этих организаций на их сайтах. Мы не передаем персональные данные другим организациям и службам, не указанным в данной политике конфиденциальности. Исключение составляет только передача информации при законных требованиях государственных органов уполномоченных осуществлять данные действия.
  
  Ссылки на другие сайты
  
  Наше приложение Hello может содержать ссылки на другие сайты, которые не управляются нами. Мы не несем ответственность за их содержание. Мы рекомендуем вам ознакомиться с политикой конфиденциальности каждого сайта, который вы посещаете, если она там есть.
  
  Изменения в политике конфиденциальности
  
  Наше приложение Hello может обновлять нашу политику конфиденциальности время от времени. Мы сообщаем о любых изменениях, разместив новую политику конфиденциальности на этой странице. Мы отслеживаем изменения законодательства, касающегося персональных данных в Европейском Союзе и в государстве Россия. Если вы оставили персональные данные у нас, то мы оповестим вас об изменении в политике конфиденциальности. Если ваши персональные данные были введены не корректно, то мы не сможем с вами связаться.
  
  Обратная связь, заключительные положения
  
  Связаться с администрацией сайта по вопросам, связанным с политикой конфиденциальности можно по адресу: wedookproducts.access@gmail.com. Если вы не согласны с данной политикой конфиденциальности, вы не можете пользоваться услугами сайта и приложения Hello, в этом случае вы должны воздержаться от посещения нашего сайта и приложения.
  `

  return (
    <Markdown>
      {text}
    </Markdown>
  )
}